---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LegendComponent
source: html/cfe9c38d-8e7a-21d1-7988-3d64ccd79707.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LegendComponent Property

"Component Type"

## Syntax (C#)
```csharp
public static ForgeTypeId LegendComponent { get; }
```